# IsPublic Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServiceOptions..::..IsPublic Property
ExternalServiceOptions Class See Also
---
This property denotes a service as either public or private.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsPublic { get; set; }
```

Visual Basic
---
```text
Public Property IsPublic As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsPublic {
	bool get ();
	void set (bool value);
}
```

# Remarks
A public service can be executed by anyone, while a private service can be execute only by the caller who registered it (the owner of the service, typically), or by someone who has access to the service's execution key.
Unless specified otherwise, all services are created as private by default.
# See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace